package interfaces

import (
	"main/server/model"
	"main/server/common/storage"
)

func Contact() {
	for _, row := range []model.Interface_contact{
        {
			InterfaceID: 1,
			Ver:         1,
			Name:        "Standard",
			Slug:        "standard",
			Phone:       "( +995 568 ) 669 331",
			Email:       "support@yacco.com",
			Location:    "ვარკეთილი, IV მიკრო/რაიონი, 2 რიგი, შენობა №14-ის მოპირდაპირე მხარეს",
			ShortDesc:   "Yacco- ს აქვს სპორტული და ტექნიკური წარმატების დიდი ისტორია, უკეთესი პროდუქციის მუდმივი ძიების წყალობით, მისი მომხმარებლების უდიდესი კმაყოფილებისთვის. აქვს სპორტული და ტექნიკური წარმატების დიდი ისტორია, უკეთესი პროდუქციის მუდმივი ძიების წყალობით, მისი მომხმარებლების უდიდესი კმაყოფილებისთვის. აქვს სპორტული და ტექნიკური წარმატების დიდი ისტორია, უკეთესი პროდუქციის მუდმივი ძიების წყალობით, მისი მომხმარებლების უდიდესი კმაყოფილებისთვის.Yacco- ს აქვს სპორტული და ტექნიკური წარმატების დიდი ისტორია, უკეთესი პროდუქციის მუდმივი ძიების წყალობით, მისი მომხმარებლების უდიდესი კმაყოფილებისთვის. აქვს სპორტული და ტექნიკური წარმატების დიდი ისტორია, უკეთესი პროდუქციის მუდმივი ძიების წყალობით, მისი მომხმარებლების უდიდესი კმაყოფილებისთვის. აქვს სპორტული და ტექნიკური წარმატების დიდი ისტორია, უკეთესი პროდუქციის მუდმივი ძიების წყალობით, მისი მომხმარებლების უდიდესი კმაყოფილებისთვის..",
		},
    } { storage.DB.Create(&row) }
}